## List, Tuple, Set, Dictionary

In [ ]:
"""Data structure

List         orderd      changable             duplicate
Tuple        orderd      unchangable           duplicate
set          unorderd    addable/removable     no duplicate
Dictionary   unorderd    changable             no duplicate

""""

In [46]:
L = [1,3,4,"name",3]   
T = (1,3,5,"name",3)  
S = {1,2,5,"name",3} 
D = {23:"tower",'B':43, 'C':"CCD"}
print(type(L))
print(type(T))
print(type(S))
print(type(D))

<class 'list'>
<class 'tuple'>
<class 'set'>
<class 'dict'>

In [47]:
print(L[1])
print(T[1])
print(3 in S)
print(D[23])

3
3
True
tower

In [49]:
L = [1,3,4,"name",3]
T = (1,3,5,"name",3)
S = {1,2,5,"name",3}
D = {23:"tower",'B':43, 'C':"CCD"}

print(L[1:3])
print(L[::-1])
print(T[:3])

[3, 4]
[3, 'name', 4, 3, 1]
(1, 3, 5)

In [50]:
L = [1,3,4,"name",3]

L2 = L + [4,5,"Add new number"]
print(L2)

L.append(6.8)
print(L)

del L[3]
print(L)

L3 = L
L3[2] = "four point"
print(L3)

L4 = L.copy()   # we use this for coply the value of L in L4
L4[2] = "second method"
print(L4)

L5 = L[1:5]
print(L5)

[1, 3, 4, 'name', 3, 4, 5, 'Add new number']
[1, 3, 4, 'name', 3, 6.8]
[1, 3, 4, 3, 6.8]
[1, 3, 'four point', 3, 6.8]
[1, 3, 'second method', 3, 6.8]
[3, 'four point', 3, 6.8]

In [51]:
T1 = (1,3,5,"name",3)
T2 = ("A", "F", 45)
T3 = T1+T2
print(T3)

(1, 3, 5, 'name', 3, 'A', 'F', 45)

In [52]:
s = {1,2,5,"name",3}
s.update({23,"game", 1})
print(s)

s.remove("game")
print(s)

{1, 2, 3, 5, 23, 'name', 'game'}
{1, 2, 3, 5, 23, 'name'}

In [53]:
D = {23:"tower",'B':43, 'C':"CCD"}
D["new key"] = "Rishabh"
print(D)

del D['C']
print(D)

D2 = {"y": "YY", "z": 10}
D.update(D2)
print(D)

D.items()

{23: 'tower', 'B': 43, 'C': 'CCD', 'new key': 'Rishabh'}
{23: 'tower', 'B': 43, 'new key': 'Rishabh'}
{23: 'tower', 'B': 43, 'new key': 'Rishabh', 'y': 'YY', 'z': 10}

dict_items([(23, 'tower'), ('B', 43), ('new key', 'Rishabh'), ('y', 'YY'), ('z', 10)])

## Date time

In [16]:
import os
from os import path
import datetime
from datetime import date, time, datetime, timedelta
import time

In [17]:
def main():
    # get today date
    today = date.today()
    print('Today date',today)       
    print('date component', today.day, today.month, today.year)
    
    # Retrieve today's weekday (0 = Monday, 6 = Sunday)
    print('Today is weekly is', today.weekday())
    
    # today current time
    today_time = datetime.now()
    print('current time', today_time)
    
    # Get the current time
    t = datetime.time(datetime.now())
    print('The current time is',t)
    
main()

Today date 2022-09-01
date component 1 9 2022
Today is weekly is 3
current time 2022-09-01 22:38:51.626671
The current time is 22:38:51.626745

In [18]:
from datetime import datetime

def main():
    now = datetime.now()
    
    # %y - Year, %A - weekday, %B - month, %d - day of month
    print(now.strftime('The current year is: %Y' ))
    print(now.strftime("%a, %d, %B, %Y" ))
    
main()

The current year is: 2022
Thu, 01, September, 2022

In [21]:
import time
import datetime
from datetime import timedelta
from datetime import date, time, datetime, timedelta

print(timedelta(days=365, hours=5, minutes=1))

now = datetime.now()
print('Today',today_time

print('One year from now it will be', str(now + timedelta(days=365)))

print('In two weeks and 3 days it will be', str(now + timedelta(weeks=2, days=3)))

#calculate the date 1 week ago formated as a string
t = datetime.now() - timedelta(weeks=1)
s = t.strftime("%A %B %d %Y")
print("One week ago it was", s)

SyntaxError: invalid syntax (2475789331.py, line 11)

In [30]:
## Calendar
import calendar

# Create Plain text calendar
c = calendar.TextCalendar(calendar.SUNDAY)
str = c.formatmonth(2022, 1, 0, 0)
print(str)

    January 2022
Su Mo Tu We Th Fr Sa
                   1
 2  3  4  5  6  7  8
 9 10 11 12 13 14 15
16 17 18 19 20 21 22
23 24 25 26 27 28 29
30 31

## Exercise-1

## Date time

In [26]:
## todat date
import pandas as pd
from datetime import date
print(date.today())

now = pd.to_datetime(str(date.today()), format='%Y-%m-%d')
print(now)

2022-09-01
2022-09-01 00:00:00

## Pivot table
### In pivot table we can use aggr function but in pivot we cant use aggr fun

In [50]:
import pandas as pd
df = pd.read_excel('SaleData.xlsx')
df

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.00,1198.000,113810.00
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.00,500.000,25000.00
2,2018-02-09,Central,Hermann,Luis,Television,36.00,1198.000,43128.00
3,2018-02-26,Central,Timothy,David,Cell Phone,27.00,225.000,6075.00
4,2018-03-15,West,Timothy,Stephen,Television,56.00,1198.000,67088.00
5,2018-04-01,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
6,2018-04-18,Central,Martha,Steven,Television,75.00,1198.000,89850.00
7,2018-05-05,Central,Hermann,Luis,Television,90.00,1198.000,107820.00
8,2018-05-22,West,Douglas,Michael,Television,32.00,1198.000,38336.00
9,2018-06-08,East,Martha,Alexander,Home Theater,60.00,500.000,30000.00
10,2018-06-25,Central,Hermann,Sigal,Television,90.00,1198.000,107820.00
11,2018-07-12,East,Martha,Diana,Home Theater,29.00,500.000,14500.00
12,2018-07-29,East,Douglas,Karen,Home Theater,81.00,500.000,40500.00
13,2018-08-15,East,Martha,Alexander,Television,35.00,1198.000,41930.00
14,2018-09-01,Central,Douglas,John,Desk,2.00,125.000,250.00
15,2018-09-18,East,Martha,Alexander,Video Games,16.00,58.500,936.00
16,2018-10-05,Central,Hermann,Sigal,Home Theater,28.00,500.000,14000.00
17,2018-10-22,East,Martha,Alexander,Cell Phone,64.00,225.000,14400.00
18,2018-11-08,East,Douglas,Karen,Cell Phone,15.00,225.000,3375.00
19,2018-11-25,Central,Hermann,Shelli,Video Games,96.00,58.500,5616.00
20,2018-12-12,Central,Douglas,John,Television,67.00,1198.000,80266.00
21,2018-12-29,East,Douglas,Karen,Video Games,74.00,58.500,4329.00
22,2019-01-15,Central,Timothy,David,Home Theater,46.00,500.000,23000.00
23,2019-02-01,Central,Douglas,John,Home Theater,87.00,500.000,43500.00
24,2019-02-18,East,Martha,Alexander,Home Theater,4.00,500.000,2000.00
25,2019-03-07,West,Timothy,Stephen,Home Theater,7.00,500.000,3500.00
26,2019-03-24,Central,Hermann,Luis,Video Games,50.00,58.500,2925.00
27,2019-04-10,Central,Martha,Steven,Television,66.00,1198.000,79068.00
28,2019-04-27,East,Martha,Diana,Cell Phone,96.00,225.000,21600.00
29,2019-05-14,Central,Timothy,David,Television,53.00,1198.000,63494.00
30,2019-05-31,Central,Timothy,David,Home Theater,80.00,500.000,40000.00
31,2019-06-17,Central,Hermann,Shelli,Desk,5.00,125.000,625.00
32,2019-07-04,East,Martha,Alexander,Video Games,62.00,58.500,3627.00
33,2019-07-21,Central,Hermann,Sigal,Video Games,55.00,58.500,3217.50
34,2019-08-07,Central,Hermann,Shelli,Video Games,42.00,58.500,2457.00
35,2019-08-24,West,Timothy,Stephen,Desk,3.00,125.000,375.00
36,2019-09-10,Central,Timothy,David,Television,7.00,1198.000,8386.00
37,2019-09-27,West,Timothy,Stephen,Cell Phone,76.00,225.000,17100.00
38,2019-10-14,West,Douglas,Michael,Home Theater,57.00,500.000,28500.00
39,2019-10-31,Central,Martha,Steven,Television,14.00,1198.000,16772.00
40,2019-11-17,Central,Hermann,Luis,Home Theater,11.00,500.000,5500.00
41,2019-12-04,Central,Hermann,Luis,Home Theater,94.00,500.000,47000.00
42,2019-12-21,Central,Martha,Steven,Home Theater,28.00,500.000,14000.00
43,NaT,NaN,NaN,NaN,NaN,278.00,1125.000,62550.00
44,NaT,NaN,NaN,NaN,NaN,34.75,140.625,7818.75

In [40]:
pd.pivot_table(df,index=["Region","SalesMan"])

                       Sale_amt   Unit_price      Units
Region  SalesMan
Central David      28191.000000   724.200000  42.600000
        John       41338.666667   607.666667  52.000000
        Luis       41274.600000   690.900000  56.200000
        Shelli      8424.500000   185.500000  48.250000
        Sigal      41679.166667   585.500000  57.666667
        Steven     49922.500000  1023.500000  45.750000
East    Alexander  29587.875000   529.750000  49.500000
        Diana      18050.000000   362.500000  62.500000
        Karen      16068.000000   261.166667  56.666667
West    Michael    33418.000000   849.000000  44.500000
        Stephen    22015.750000   512.000000  35.500000

In [44]:
## Write a Pandas program to create a Pivot table and find the total sale amount region wise, manager wise.
pd.pivot_table(df, index = ['Region', 'Manager'], aggfunc = 'sum', values = 'Sale_amt' )

                 Sale_amt
Region  Manager
Central Douglas  124016.0
        Hermann  365108.5
        Martha   199690.0
        Timothy  140955.0
East    Douglas   48204.0
        Martha   272803.0
West    Douglas   66836.0
        Timothy   88063.0

In [46]:
## Write a Pandas program to create a Pivot table and find the item wise unit sold.
pd.pivot_table(df, index = 'Item', values = 'Units', aggfunc = 'sum')

              Units
Item
Cell Phone    278.0
Desk           10.0
Home Theater  722.0
Television    716.0
Video Games   395.0

In [56]:
## Write a Pandas program to create a Pivot table and count the manager wise sale and mean value of sale amount.
pd.pivot_table(df, index = ['Region'], values = 'Sale_amt', aggfunc=[np.mean,sum])

                 mean       sum
             Sale_amt  Sale_amt
Region
Central  34573.729167  829769.5
East     24692.846154  321007.0
West     25816.500000  154899.0

## Exercise-2

Geeky shows youtube "python concept youtube"

### break, continue, Pass

In [3]:
available = 4
x = int(input("How many candy: "))
i = 1
while i<=x:
    if i > available:
        break        # stop if loop is not true
    print("candy")
    i = i+1
print("Bye")

How many candy: 6
candy
candy
candy
candy
Bye

In [9]:
# skip true condition (skip 3 & 5 value and other value will show)
for i in range(1,20):
    if i%3==0 or i%5==0:  
        continue
    print(i)

1
2
4
7
8
11
13
14
16
17
19

In [11]:
# if condition is True then will not happen any operation due to pass
for i in range(1,10):
    if (i%2 == 0):
        pass
    else:
        print(i)

1
3
5
7
9

## Function

In [12]:
def add(a,b):  # (a,b) is *Formal argument*
    c = a+b
    print(c)
add(5,6)       # (5,6) is *Actual argument*

11

**Actual argument is four types*
* 1.Position
* 2.keyword
* 3.default
* v4.ariable length

In [2]:
def person(name, age):
    print(name)
    print(age)
person('Navin',24)               # 24 is position
person(name = 'Navin',age = 28)  # age =28 is keyword

Navin
24
Navin
28

In [3]:
# Default
# I want to pass name but i don't want to pass age

def person(name , age = 18):
    print(name)
    print(age)
person('Navin', 28)

Navin
28

In [4]:
## variable length
def sum(a, *b):   # It * means multiple value
    c = a
    for i in b:
        c = c + i
        print(c)
sum(5, 6,34, 78)

11
45
123

## Global & Local Variables

In [1]:
a = 10
def somethings():
    a = 15
    print(a)  ## Local variable
print(a)      ## Global variable

10

In [2]:
a = 10
def something():
    a = 15
    print("Infunction", a)   ## Local
something()
print("outside", a)          ## Global

Infunction 15
outside 10

In [3]:
a = 10
def something():
    global a                ## define global variable then the value in change inside the local
    a = 15
    print("Infunction", a)   
something()
print("outside", a)

Infunction 15
outside 15

## Recursion

Recursion always return self function

In [4]:
def fact(n):
    if n ==0:
        return 1
    return n*fact(n-1)
result = fact(5)
result

120

## Lamda & Anonymus function

In [6]:
def square(a):
    return a*a
result = square(5)
result

25

In [7]:
f = lambda a: a*a
result = f(5)
result

25

In [8]:
f = lambda a,b : a+b
result = f(5,6)
result

11

In [9]:
def myfunc(n):
    return lambda a: a*n
mydoubler = myfunc(2)
mydoubler(11)

22

## Filter() & Map() & Reduce()

In [11]:
## Filter

def is_even(n):
    return n%2 ==0

nums = [3,2,6,5,4,6,9]
even =  list(filter(is_even, nums))
even

[2, 6, 4, 6]

In [13]:
## Filter

nums = [8,2,4,5,7,6,9]
even =  list(filter(lambda n : n%2 == 0, nums))
even

[8, 2, 4, 6]

In [14]:
## Map
nums = [3,2,6,8,4,6,2,9]
even =  list(filter(lambda n : n%2 == 0, nums))
doubles =  list(map(lambda n : n*2, nums))
doubles

[6, 4, 12, 16, 8, 12, 4, 18]

In [15]:
## Reduce
from functools import reduce

def add_all(a,b):
    return a+b

nums = [3,2,6,8,4,6,2,9]
even =  list(filter(lambda n : n%2 == 0, nums))
doubles =  list(map(lambda n : n*2, nums))
sums = reduce(lambda a, b : a+b, doubles)
sums

80

## Fibonacci sequence

0,1,1,2,3,5,8,13,21

In [4]:
def fib(n):
    a=0
    b=1
    for i in range(2,n):
        c=a+b
        a=b
        b=c   # a,b =b,c can use this
        print(c)
fib(8)

1
2
3
5
8
13

## OOPs

class variable     ----     We place out side                                               
Instance variable  ----     we place inside this variable

In [6]:
class car:
    wheels = 4               # class variable   
    def __init__(self):      # constructor
        self.mil = 10        # Instance variable
        self.com = "BMW"
c1 = car()
c2 = car()
c1.mil = 8
print(c1.com, c1.mil, c1.wheels)
print(c2.com, c2.mil, c2.wheels)

BMW 8 4
BMW 10 4

In [8]:
class student:
    school = 'Colonal'
    def __init__(self, m1,m2,m3):
        self.m1 = m1
        self.m2 = m2
        self.m3 = m3
    def avg(self):                              
        return (self.m1 + self.m2 + self.m3)/3
    def get_m1(self):
        return self.m1                            ## get the value
    def set_m1(self, value):
        self.m1  = value                          ## set the value means change the m1 value

s1 = student(10,20,30)
s2 = student(10,20,30)
print(s1.avg())

20.0

### **object**  -- There is two types 
* variable
* method  -- **Instance method, Class method, Static method**                                       
The classmethod, staticmethod, property are Decorator

In [7]:
class student:
    school = 'Colonal'
    def __init__(self, m1,m2,m3):
        self.m1 = m1
        self.m2 = m2
        self.m3 = m3
    def avg(self):                                 ## Instance Method
        return (self.m1 + self.m2 + self.m3)/3
s1 = student(10,20,30)
s1.avg()

20.0

In [9]:
class student:
    school = 'Colonal'                         # class variable
    def __init__(self, m1,m2,m3):
        self.m1 = m1
        self.m2 = m2
        self.m3 = m3
    def avg(self):                              
        return (self.m1 + self.m2 + self.m3)/3  
    @classmethod
    def info(cls):
        return cls.school
    
    """ @classmethod hmesa class variable ko 
        access krne ke liye kiya jata hain  """
                  
s1 = student(10,20,30)
s2 = student(10,20,30)
print(s1.info())

Colonal

In [14]:
class student:
    school = 'Colonal'                         # class variable
    def __init__(self, m1,m2,m3):
        self.m1 = m1
        self.m2 = m2
        self.m3 = m3
    def avg(self):                              
        return (self.m1 + self.m2 + self.m3)/3  
    @classmethod
    def getschool(cls):
        return cls.school
    
    @staticmethod
    def info():
        print("This is the student class")
    
    
    """ @staticmethod hmesa  apne function ko 
        run karta hai uuse class se matlab nhi hota hain  """
                  
s1 = student(10,20,30)
print(s1.getschool())
print(student.info())

Colonal
This is the student class
None

In [1]:
class Employee:
    company = "Bharat Gas"
    salary = 5600
    salarybonus = 500
    
    @property
    def totalsalary(self):
        return self.salary + self.salarybonus
    """ @property decorator will give the output as a property only,.
        It seems to be is property """
    
e = Employee()
e.totalsalary

6100

## Inner class in oops

In [16]:
class student:
    def __init__(self, name, roll_no):
        self.name = name
        self.roll_no = roll_no
        self.lap = self.Laptop()
    def show(self):
        print(self.name, self.roll_no)
        
    class Laptop:
        def __init__(self):
            self.brand = 'HP'
            self.cpu = 'i5'
            self.ram = 8
            
s1 = student('Navin',2)
s2 = student('Jerry',3)
print(s1.lap.brand)
print(s1.show())

HP
Navin 2
None

## Inheritance

In [48]:
class A:                                     ## Super class/parent calss
    def feature1(self):
        print('feature 1 working')
    def feature2(self):
        print('feature 2 working')
class B(A):                                 ## subclass/childclass
    def feature3(self):
        print('feature 3 working')
    def feature4(self):
        print('feature 4 working')
class C(B):
    def feature5(self):
        print("feature 5 working")
        
a1 = A()
print(a1.feature1())
print(a1.feature2())

b1 = B()
print(b1.feature2())   ## inheritance acces the super class
print(b1.feature3())

c1 = C()
print(c1.feature2())
print(c1.feature4())

feature 1 working
None
feature 2 working
None
feature 2 working
None
feature 3 working
None
feature 2 working
None
feature 4 working
None

In [53]:
class A:                                     ## Super class
    def __init__(self):
        print("In A init")
    def feature1(self):
        print('feature 1 working')
    def feature2(self):
        print('feature 2 working')
class B(A):                                 ## subclass/childclass
    def __init__(self):
        print("In B init")
    def feature3(self):
        print('feature 3 working')
    def feature4(self):
        print('feature 4 working')
        
a1 = A()
a1

In A init

### **Super function**  super().__init__()
* first print left then right
* Function super, gives the super class value & child value as well.
* How Constructor behaves in heritance
* How to use super() in inheritance
* Method Resolution order(MRO)

In [56]:
class A:                                     ## Super class
    def __init__(self):
        print("In A init")
    def feature1(self):
        print('feature 1 working')
    def feature2(self):
        print('feature 2 working')

class B(A):                                 
    def __init__(self):
        super().__init__()
        print("In B init")
    def feature5(self):
        print('feature 3 working')
    def feature6(self):
        print('feature 4 working')
        
b1 = B()
b1

In A init
In B init

In [63]:
class A:                                     ## Super class
    def __init__(self):
        print("In A init")
    def feature1(self):
        print('feature 1-A working')
    def feature2(self):
        print('feature 2 working')
class B:                                 ## subclass/childclass
    def __init__(self):
        print("In B init")
    def feature1(self):
        print('feature 1-B working')
    def feature4(self):
        print('feature 4 working')
class C(A,B):                                 
    def __init__(self):
        super().__init__()
        print("In c init")
    def feat(self):
        super().feature2()
    def feature6(self):
        print('feature 6 working')
        
c1 = C()
c1
print("....")
c1.feature1()
print("....")
c1.feat()

In A init
In c init
....
feature 1-A working
....
feature 2 working